Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: Homepage
pt_br: Página inicial

source: Hopefully this will clear some confusion.
pt_br: Este trecho provavelmente vai solucionar algumas confusões.

source: Hotkeys & Hotstrings
pt_br: Hotkeys e hotstrings

source: Hotkeys (mouse, joystick and keyboard shortcuts)
pt_br: Teclas de atalho (hotkeys) — atalhos com mouse, joystique e teclado

source: Hotkeys and their methods - See ListHotkeys.
pt_br: Hotkeys e seus métodos - Veja ListHotkeys.

source: Hotkeys are also blocked, so for instance, a non-elevated program cannot spy on input intended for an elevated program.
pt_br: Hotkeys também são bloqueadas, então por exemplo, um programa não elevado não pode espionar a entrada feitas para um programa elevado.

source: Hotkeys, Hotstrings, and Remapping
pt_br: Hotkeys, Hotstrings e Remapeamento de teclas

source: Hotkeys/hotstrings don't work when a program running as admin is active.
pt_br: Hotkeys/hotstrings não funcionam quando um programa rodando como administrador está ativo.

source: Hotstring modifiers go between the first set of colons.
pt_br: Modificadores de hotstrings vão no meio do primeiro par de dois-pontos:

source: Hotstrings and auto-replace
pt_br: Hotstrings e substituição automática

source: Hotstrings are mainly used to expand abbreviations as you type them (auto-replace), they can also be used to launch any scripted action.
pt_br: As hotstrings são usadas precipuamente para expandir abreviaturas à medida que você as digita (substituição automática). Elas também podem ser usadas para executar qualquer ação que seja parte de seu script.

source: Hotstrings, as mentioned above, can also launch scripted actions.
pt_br: Hotstrings, como já dito acima, pode também executar ações do seu script.

source: How can MsgBox's button names be changed?
pt_br: Como alterar os nomes dos botões de uma MsgBox?

source: How can I change the default editor, which is accessible via context menu or tray icon?
pt_br: Como posso alterar o editor atual, que é acessível por meio do menu contexto ou ícone da bandeja?

source: How can I find and fix errors in my code?
pt_br: Como eu posso consertar erros em meu código?

source: How can I save the contents of my GUI associated variables?
pt_br: Como posso salvar o conteúdo das variáveis associadas à minha GUI?

source: How can I send text to a window which isn't active or isn't visible?
pt_br: Como posso enviar texto para uma janela que não esteja ativa ou visível?

source: How can I send the current Date and/or Time?
pt_br: Como posso enviar a data e/ou o horário atuais?

source: How can I start an action when a window appears, closes or becomes [in]active?
pt_br: Como posso iniciar uma ação quando uma janela aparece, fecha ou torna-se (in)ativa?

source: How can I use a hotkey that is not in my keyboard layout?
pt_br: Como posso usar uma hotkey que não está presente no layout do meu teclado?

source: How can Tab and Space be defined as hotkeys?
pt_br: Como definir as teclas Tab e Espaço como hotkeys?

source: How can Winamp be controlled even when it isn't active?
pt_br: Como posso controlar o Winamp mesmo que a janela dele não esteja ativa?

source: How can a hotkey or hotstring be made exclusive to certain program(s)?
pt_br: Como posso fazer com que uma hotkey ou hotstring seja exclusiva de certo(s) programa(s)?

source: How can a prefix key be made to perform its native function rather than doing nothing?
pt_br: Como posso fazer com que uma tecla de prefixo execute sua função nativa em vez de não fazer nada?

source: How can a repeating action be stopped without exiting the script?
pt_br: Como que uma ação que se repete pode ser interrompida sem que eu finalize o script?

source: How can a script close, pause, suspend or reload other script(s)?
pt_br: Como que um script pode fechar, pausar, suspender ou recarregar outro(s) script(s)?

source: How can context sensitive help for AutoHotkey commands be used in any editor?
pt_br: Como usar, em qualquer editor, a ajuda sensível ao contexto dos comandos do AutoHotkey?

source: How can dates and times be compared or manipulated?
pt_br: Como comparar ou manipular datas e horários?

source: How can keys or mouse buttons be remapped so that they become different keys?
pt_br: Como remapear teclas e botões do mouse de forma que eles se tornem teclas diferentes?

source: How can performance be improved for games or at other times when the CPU is under heavy load?
pt_br: Como posso melhorar o desempenho do meu script durante a execução de jogos ou quando o processador estiver sob forte demanda?

source: How can tab and space be defined as hotkeys?
pt_br: Como definir as teclas Tab e Espaço como hotkeys?

source: How can the built-in Windows shortcut keys, such as Win+U (Utility Manager) and Win+R (Run), be changed or disabled?
pt_br: Como posso alterar ou desabilitar as teclas de atalho nativas do Windows, como a Win+U (Gerenciador de Utilitários) ou Win+R (Executar)?

source: How can the output of a command line operation be retrieved?
pt_br: Como posso obter a saída de uma operação da linha de comando?

source: How do I detect the double press of a key or button?
pt_br: Como eu detecto o duplo pressionamento de uma tecla ou botão?

source: How do I put my hotkeys and hotstrings into effect automatically every time I start my PC?
pt_br: Como eu ponho minhas hotkeys e hotstrings em funcionamento automaticamente toda vez que eu inicio meu PC?

source: How do I restore the right-click context menu options for .ahk files?
pt_br: Como eu restauro as opções do menu contexto do clique com o botão direito para os arquivos .ahk?

source: How do I work around problems caused by User Account Control (UAC)?
pt_br: Como eu contorno problemas causados pelo Controle de Conta de Usuário (UAC)?

source: How literal text should be written within the script depends on the context.
pt_br: A forma com que texto literal deve ser escrito dentro do script depende do contexto.

source: How to create a script
pt_br: Como criar um script

source: How to detect when a web page is finished loading?
pt_br: Como detectar que uma página da web terminou de ser carregada?

source: How to find the help file on your computer
pt_br: Como encontrar o arquivo da ajuda em seu computador

source: How to use the program
pt_br: Como usar o programa

source: However there are methods that can increase the chance of working in some games, but there is no magical "make it work in my game now!!!" button.
pt_br: No entanto, há métodos que podem aumentar as chances de funcionar em alguns jogos, mas não há nenhum botão mágico do tipo “funcione no meu jogo agora!!!”

source: However, myObj := Object() only affects the variable myObj, not the variable yourObj, which still refers to the original object.
pt_br: Contudo, meuObjeto := Object() só afetará a variável meuObjeto, não a variável seuObjeto, a qual ainda se refere ao objeto original.

source: However, ControlSend isn't useful unless Keys are specified, and usually one must also specify the target window.
pt_br: No entanto, ControlSend não tem utilidade a não ser que Teclas sejam especificadas, e geralmente também é necessário especificar a janela alvo.

source: However, a quoted string (or the result of concatenating with a quoted string) is never considered numeric when used directly in an expression.
pt_br: Entretanto, uma string entre aspas (ou o resultado de da concatenação com uma string entre aspas) nunca é considerada numérica quando usada diretamente numa expressão.

source: However, any programs or scripts which the script launches by calling Run or RunWait usually inherit a copy of the parent script's environment variables.
pt_br: Todavia, quaisquer programas ou scripts que o script vier a executar por meio do comando Run ou RunWait normalmente herdam uma cópia das variáveis de ambiente do script pai.

source: However, converting a floating-point number to a string causes the number to be rounded according to the current float format, which defaults to 6 decimal places.
pt_br: Porém, converter um número de ponto flutuante em uma string faz com que o número seja arredondado de acordo com o formato de ponto flutuante atual, que, por padrão, tem 6 casas decimais.

source: However, directives, labels (including hotkeys and hotstrings), and declarations without assignments are not statements; they are processed when the program first starts up, before the script executes.
pt_br: Porém, diretivas, rótulos (incluindo hotkeys e hotstrings) e declarações sem atribuições de valor não são instruções; eles são processados assim que o programa inicia, antes de o script executar.

source: However, hotkeys with the # modifier can be triggered by either Win.
pt_br: No entanto, as hotkeys com o modificador # podem ser desencadeadas por quaisquer das teclas Win, esquerda ou direita.

source: However, some applications require that the modifier keys be released.
pt_br: Contudo, alguns aplicativos requerem que as teclas modificadoras sejam soltas.

source: However, some code pages contain characters which are represented by sequences of multiple bytes (these are always non-ASCII characters).
pt_br: Entretanto, algumas páginas de código contêm caracteres que são representados por sequências de múltiplos bytes (estas são sempre caracteres não ASCII).

source: However, sometimes a function or command completes before its effects can be seen by the user.
pt_br: Contudo, algumas vezes a função ou comando completa antes que seus efeitos possam ser vistos pelo usuário.

source: However, the Alt+CapsLock, Ctrl+CapsLock and Shift+CapsLock shortcuts can be disabled with a workaround.
pt_br: Entretanto, os atalhos Alt+CapsLock, Ctrl+CapsLock e Shift+CapsLock podem ser desabilitadas com uma solução de contorno.

source: However, the Blind mode does not prevent masking performed by the keyboard hook following activation of a hook hotkey.
pt_br: No entanto, o modo Cego não impede o “mascaramento” feito pelo gancho de teclado que sucede a ativação de uma hotkey de gancho.

source: However, the long history of AutoHotkey v1 and an emphasis on backward-compatibility have resulted in a divide between commands, which require legacy syntax, and functions, which require expression syntax.
pt_br: Entretanto, a longa história do AutoHotkey v1 e a ênfase em retrocompatibilidade têm resultado em uma divisão entre comandos, os quais requerem sintaxe legada, e funções, que requerem a sintaxe de expressão.

source: However, these are usually only useful in combination with data structures and the DllCall function.
pt_br: Entretanto, essas funções só são úteis em combinação com estruturas de dados e com a função DllCall.

source: However, this only applies when Keys begins with {Text} or {Blind}{Text}.
pt_br: Entretanto, isso só se aplica quando as Keys começam com {Text} ou {Blink}{Text}.

source: However, uppercase non-ASCII characters such as 'Ä' are not considered equal to their lowercase counterparts, regardless of the current user's locale.
pt_br: Todavia, caracteres não ASCII maiúsculos, como “Ä”, não são consideradas iguais aos seus correspondentes minúsculos, independentemente da configuração de região do usuário.

source: However, when a script launches a program or document, the operating system usually requires quotes around any command-line parameter that contains spaces, such as in this example:
pt_br: Entretanto, quando um script executa um programa ou documento, o sistema operacional geralmente exige aspas em volta de quaisquer parâmetros da linha de comando que contenha espaços, como neste exemplo:

source: I can't edit my script via tray icon because it won't start due to an error.
pt_br: Eu não consigo editar meu script pelo ícone da bandeja porque aquele não inicia devido a um erro.

source: I hope you have learned something.
pt_br: Espero que você tenha aprendido algo.

source: I'm having trouble getting my mouse buttons working as hotkeys.
pt_br: Estou tendo problemas para fazer os botões do meu mouse funcionarem como hotkeys.

source: I've upgraded my computer/Windows and now my script won't work.
pt_br: Eu fiz upgrade do meu computador/Windows e agora meu script não funciona mais.

source: If Length is omitted it defaults to 1.
pt_br: Se Comprimento é omitido, ele assume o valor padrão 1.

source: If NumLock is OFF but Shift is pressed, the system temporarily releases Shift and acts as though NumLock is ON.
pt_br: Se a tecla NumLock está DESLIGADA mas a tecla Shift está pressionada, o sistema temporariamente solta a Shift e age como se NumLock estivesse LIGADA.

source: If AutoHotkey is pinned to the taskbar or Start menu on Windows 7 or later, recent or pinned scripts can be launched via the program's Jump List.
pt_br: Se o AutoHotkey estiver fixo na barra de tarefas ou no Menu Iniciar do Windows 7 e posteriores, scripts recentes ou fixados podem ser executados pela ***lista suspensa*** do programa.

source: If AutoHotkey was previously installed, the installer automatically detects which version of AutoHotkey.exe to set as the default.
pt_br: Se o AutoHotkey foi previamente instalado, o instalador automaticamente detecta que versão do AutoHotkey.exe deverá ser definida como a padrão.

source: If Notepad is not running:
pt_br: Se o Bloco de Notas não estiver em execução:

source: If a variable or parameter is said to be "empty" or "blank", that usually means an empty string (a string of zero length).
pt_br: Se uma variável ou parâmetro é dito “vazio” ou “em branco”, isso geralmente é o mesmo que uma string vazia (uma string de comprimento zero).

source: If a game has a cheat prevention system and your hotkeys, hotstrings and Send commands do not work, you are out of luck.
pt_br: Se um jogo tem um sistema de prevenção de cheats e suas hotkeys, hotstrings e comandos Send não funcionam, você está sem sorte.

source: If a script lacks the #NoEnv directive, reading an empty variable will instead return the value of the environment variable with that name, if there is one.
pt_br: Se um script não possui a diretiva #NoEnv, ler uma variável vazia vai, em vez disso, retornar o valor da variável de ambiente com aquele nome, se houver uma.

source: If a script's Hotkeys, Clicks, or Sends are noticeably slower than normal while the CPU is under heavy load, raising the script's process-priority may help.
pt_br: Se as Hotkeys, Clicks ou Sends de um script estão visivelmente mais lentos que o normal enquanto a CPU está sob forte carga, aumentar a prioridade do processo do script pode ajudar.

source: If a variable has both, the number is used.
pt_br: Se uma variável possui ambos, o número é usado.

source: If a variable is not visible within a given scope, the same name can refer to a different variable.
pt_br: Se uma variável não está visível dentro de determinado escopo, o mesmo nome pode ser referir a uma outra variável.

source: If all these fail, it may not be possible for AHK to work with your game.
pt_br: Se todas estas falharem, então pode não ser possível que o AHK funcione com o seu jogo.

source: If any these UIA files are present before installation, the installer will automatically update them even if the UI Access option is not enabled.
pt_br: Se quaisquer desses arquivos UIA estiverem presentes antes da instalação, o instalador irá automaticamente atualizá-los mesmo se a opção UI Access não estiver marcada.

source: If everything you try fails, it may not be possible to use AutoHotkey for your needs.
pt_br: Se tudo que você tentar falhar, pode ser que o AutoHotkey não sirva para suas necessidades.

source: If in doubt, use lowercase.
pt_br: Se estiver em dúvida, use letra minúscula.

source: If in doubt, you could send the file to the vendor of your antivirus software for confirmation.
pt_br: Se estiver em dúvida, você pode enviar o arquivo para o fornecedor de seu antivírus para confirmação.

source: If it's not in the chart, it does not need brackets.
pt_br: Se não estiver na tabela, então não requer chaves.

source: If one form of Send does not work for your needs, try another type of Send.
pt_br: Se uma das formas do comando Send não funcionar para suas necessidades, tente outro tipo de Send.

source: If present, this script is automatically "included" before any script that the program loads, and before any file specified with /include.
pt_br: Se presente, esse script é automaticamente “incluído” antes de qualquer script que o programa carrega, e antes de qualquer arquivo especificado com /include.

source: If so, SUCCESS!
pt_br: Se abriu, SUCESSO!

source: If that did not yield results that satisfy you, read below.
pt_br: Se isso não gerar os resultados que lhe satisfaçam, continue lendo.

source: If that doesn't work, you can open the file in Notepad or another editor.
pt_br: Se isso não funcionar, você pode abrir o arquivo no Bloco de Notas ou outro editor.

source: If that's difficult to understand, try thinking of an object as a rental unit.
pt_br: Se está difícil entender, tente pensar nos objetos como uma casa que você aluga.

source: If the "slow" mode of SetFormat is present anywhere in the script, numbers are always converted to strings when assigned to a variable.
pt_br: Se o modo “lento” do comando SetFormat está presente em qualquer lugar do script, números são sempre convertidos em strings quando atribuídos a uma variável.

source: If the computer has more than one joystick and you want to use one beyond the first, include the joystick number (max 16) in front of the control name.
pt_br: se o computador possui mais de um joystick e você deseja usar um que não seja o primeiro, inclua o número do joystick (máximo de 16) na frente do nome do controle.

source: If the program you are trying to start is in %A_WinDir%\System32 and you are using AutoHotkey 32-bit on a 64-bit system, the File System Redirector may be interfering.
pt_br: Se o programa que você está tentando iniciar está na pasta %A_WinDir\System32% e você está usando AutoHotkey de 32 bits num sistema de 64 bits, o Redirecionador de Arquivos do Sistema pode estar interferindo.

source: If the script is already running, you can use the Edit command or right-click the script's tray icon and select Edit This Script.
pt_br: Se o script já estiver em execução, você pode usar o comando Edit ou clique com o botão direito em seu ícone da bandeja e selecionar Edit This Script.

source: If they cannot be seen -- or if your mouse has more than five buttons that you want to use -- you can try configuring the software that came with the mouse (sometimes accessible in the Control Panel or Start Menu) to send a keystroke whenever you press one of these buttons.
pt_br: Se eles não puderem ser vistos — ou se seu mouse tem mais de cinco botões que você quer usar — você pode tentar configurar o software que veio com o mouse (às vezes acessível pelo Painel de Controle ou Menu Iniciar) para enviar um pressionamento de tecla toda vez que você pressionar um de tais botões.

source: If they do, there is a high chance that AutoHotkey will not work with that game.
pt_br: Se tiverem, haverá uma alta probabilidade de o AutoHotkey não funcionar com esse jogo.

source: If this function is present, the /E switch can be used to invoke it from the command line.
pt_br: Se essa função estiver presente, o switch /E pode ser usado para invocá-la a partir da linha de comando.

source: If this is the case, you cannot directly make that particular key a hotkey because your keyboard driver or hardware handles it at a level too low for AutoHotkey to access.
pt_br: Se esse for seu caso, você não poderá criar uma hotkey diretamente a partir daquela tecla porque seu driver de teclado ou hardware manipula-a num nível muito baixo para que o AutoHotkey acesse.

source: If you are having issues and you know the game uses DirectX, try the stuff described on the FAQ page.
pt_br: Se você estiver tendo problemas e sabe que o jogo usa DirectX, tente aquilo que está descrito na página das Perguntas Frequentes.

source: If you are running another AutoHotkey executable directly, the name of the script depends on the executable.
pt_br: Se você está usando outro executável do AutoHotkey diretamente, o nome do script depende do executável.

source: If you are using AutoHotkey without having installed it, look in the directory which contains AutoHotkey.exe.
pt_br: Se você está usando o AutoHotkey sem tê-lo instalado, verifique o diretório que contém o executável AutoHotkey.exe.

source: If you don't get an answer right away, wait at least 1 day (24 hours) before asking for more help.
pt_br: Se você não obtiver uma resposta logo, espere pelo menos um dia (24 horas) antes de pedir mais ajuda.

source: If you get a UAC prompt, hold Ctrl or Shift as you click Yes/Continue.
pt_br: Se aparecer um prompt da UAC, segure Ctrl ou Shift enquanto você clica em Yes/Continue.

source: If you get confused, try reading the section again.
pt_br: Se ficar confuso, tente reler a seção.

source: If you have a five-button mouse whose fourth and fifth buttons cannot be seen, you can try changing your mouse driver to the default driver included with the OS.
pt_br: Se você tiver um mouse de cinco botões cujo quarto e quinto botões não podem ser vistos, você pode tentar alterar o driver do seu mouse para o driver padrão incluído com o sistema operacional.

source: If you have manually extracted the setup files from the installer EXE, use either setup.exe /S or AutoHotkeyU32.exe Installer.ahk /S.
pt_br: Se você extraiu manualmente os arquivos de instalação do EXE instalador, use ou setup.exe /S ou AutoHotkeyU32.exe Installer.ahk /S.

source: If you have trouble getting a script to recognize your joystick, one person reported needing to specify a joystick number other than 1 even though only a single joystick was present.
pt_br: Se você tiver problemas para fazer um script reconhecer um joystick, uma pessoa reportou a necessidade de especificar um número de joystick que não seja 1 mesmo que somente um joystick esteja presente.

source: If you launch AutoHotkey from the Start menu or by running AutoHotkey.exe directly (without command line parameters), it will look for a script in one of the locations shown above.
pt_br: Se você executar o AutoHotkey a partir do Menu Iniciar ou executando o arquivo AutoHotkey.exe diretamente (sem parâmetros da linha de comando), ele irá procurar por um script em um dos locais acima.

source: If you still get an error, modify your code some more.
pt_br: Se você ainda estiver se deparando com o erro, modifique seu código um pouco mais.

source: If you try something and it gives you an error, study that error.
pt_br: Se você tentar algo e obtiver um erro, estude esse erro.

source: If you want to learn more about that stuff, visit the Run page.
pt_br: Se quiser aprender mais sobre, visite a página do comando Run.

source: If you were to ignore WinTitle, WinText, it would look like this and cause issues:
pt_br: Se você ignorasse TituloJanela, TextoJaneta, então ficaria assim e daria problemas:

source: If you've also updated to a newer version of AutoHotkey, find out which version you had before and then check the changelog and compatibility notes.
pt_br: Se você também atualizou para uma versão mais nova do AutoHotkey, descubra qual versão você tinha antes e aí verifique o changelog e as notas de compatibilidade.

source: If you've switched operating systems, it is likely that something else has also changed and may be affecting your script.
pt_br: Se você mudou de sistema operacional, é provável que algo mais mudou e que está afetando seu script.

source: If your key is detectable, make a note of the 3-digit hexadecimal value in the second column of the list (e.g. 159).
pt_br: Se sua tecla é detectável, tome nota do valor hexadecimal de 3 dígitos na segunda coluna da lista (por exemplo: 159).
